;0 6 7 3 4 2 5 3  

code   SEGMENT
       ASSUME cs:code

begin: 
       mov    dl, 10110101b  ; Вихідне числo

       ; змістити 3 біт на 0
       mov    al, dl        ; робимо копію dl в al
       and    al, 00001000b ; залишаємо незмінним 3 біт, решту обнуляємо
       mov    cl, 3         ; зберігамо зсув
       shr    al, cl        ; переміщаємо на 3 біт вправо
       or     dh, al        ; оновлюємо результат
       
       ; змістити 5 біт на 1
       mov    al, dl        ; робимо копію dl в al
       and    al, 00100000b ; залишаємо незмінним 5 біт, решту обнуляємо
       mov    cl, 4         ; зберігамо зсув
       shr    al, cl        ; переміщаємо на 4 бітів вправо
       or     dh, al        ; оновлюємо результат

       ; змістити 2 біт на 2
       mov    al, dl        ; робимо копію dl в al
       and    al, 00000100b ; залишаємо незмінним 2 біт, решту обнуляємо
       or     dh, al        ; оновлюємо результат


       ; змістити 4 біт на 3
       mov    al, dl        ; робимо копію dl в al
       and    al, 00010000b ; залишаємо незмінним 4 біт, решту обнуляємо
       mov    cl, 1         ; зберігамо зсув
       shr    al, cl        ; переміщаємо на 1 біт вправо
       or     dh, al        ; оновлюємо результат

       ; змістити 3 біт на 4
       mov    al, dl        ; робимо копію dl в al
       and    al, 00001000b ; залишаємо незмінним 3 біт, решту обнуляємо
       mov    cl, 1         ; зберігамо зсув
       shr    al, cl        ; переміщаємо на 1 біт вправо
       or     dh, al        ; оновлюємо результат
       
       ; змістити 7 біт на 5
       mov    al, dl        ; робимо копію dl в al
       and    al, 10000000b ; залишаємо незмінним 7 біт, решту обнуляємо
       mov    cl, 2         ; зберігамо зсув
       shr    al, cl        ; переміщаємо на 2 бітів вправо
       or     dh, al        ; оновлюємо результат

       ; змістити 6 біт на 6
       mov    al, dl        ; робимо копію dl в al
       and    al, 01000000b ; залишаємо незмінним 6 біт, решту обнуляємо
       or     dh, al        ; оновлюємо результат
       
       ; змістити 0 біт на 7
       mov    al, dl        ; робимо копію dl в al
       and    al, 00000001b ; залишаємо незмінним 0 біт, решту обнуляємо
       mov    cl, 7         ; зберігамо зсув
       shl    al, cl        ; переміщаємо на 7 бітів вліво
       or     dh, al        ; оновлюємо результат


       nop 
       mov    ax, 4c00h
       int    21h 

code   ENDS
       end    begin



 
 